Revit 2024 API
BuiltInFailures.ElectricalFailures.NotPositiveBendRadius Property
 The value you entered for the bend radius is zero or a negative value. Enter a positive value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotPositiveBendRadius { get; }
Visual Basic
Public Shared ReadOnly Property NotPositiveBendRadius As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotPositiveBendRadius {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace